# Item Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DoubleArray..::..Item Property
DoubleArray Class See Also
---
Gets or sets a double at a specified index within the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual double this[
	int index
] { get; set; }
```

Visual Basic
---
```text
Public Overridable Property Item ( _
	index As Integer _
) As Double
	Get
	Set
```

Visual C++
---
```text
public:
virtual property double Item[int index] {
	double get (int index);
	void set (int index, double value);
}
```

# ### Parameters
index
    Type: System..::..Int32The index of the double to be set or retrieved.
# ### Return Value
Returns the double at the specified index.
# See Also
DoubleArray Class
Autodesk.Revit.DB Namespace